package main

import (
	"fmt"
	"log"
	"os"
	"path/filepath"
)

func check(err error, msg string) {
	if err != nil {
		log.Fatalf("%s: %v", msg, err)
	}
}

// TemporaryFilesAndDirectories แสดงวิธีการสร้างไฟล์และไดเรกทอรีชั่วคราวโดยใช้แพ็คเกจ os
//
// ไฟล์และไดเรกทอรีชั่วคราวมักจะถูกใช้เพื่อเก็บข้อมูลชั่วคราวที่ต้องเข้าถึงโดย
// กระบวนการอื่นหรือที่ต้องการเก็บรักษาไว้ระหว่างการเรียกโปรแกรมหลายครั้ง
//
// แพ็คเกจ os มีฟังก์ชันสองตัวสำหรับการสร้างไฟล์และไดเรกทอรีชั่วคราว: os.CreateTemp และ
// os.MkdirTemp ฟังก์ชันแรกจะสร้างไฟล์ชั่วคราวใหม่ในไดเรกทอรีที่ระบุโดยอาร์กิวเมนต์แรก
// และคืนค่าการจัดการไฟล์และชื่อของไฟล์ ฟังก์ชันที่สองจะสร้างไดเรกทอรีชั่วคราวใหม่
// และคืนค่าชื่อของไดเรกทอรี
//
// ฟังก์ชันเหล่านี้จะคืนค่าข้อผิดพลาดหากไฟล์หรือไดเรกทอรีนั้นมีอยู่แล้ว ดังนั้นจึงเป็น
// ความคิดที่ดีที่จะใช้คำสั่ง defer เพื่อลบไฟล์หรือไดเรกทอรีหลังจากที่ไม่ต้องการอีกต่อไป
// เพื่อหลีกเลี่ยงการทิ้งไฟล์และไดเรกทอรีชั่วคราวไว้
func main() {
	// สร้างไฟล์ชั่วคราวโดยใช้ os.CreateTemp
	f, err := os.CreateTemp("", "sample")
	check(err, "ไม่สามารถสร้างไฟล์ชั่วคราวได้")

	// ลบไฟล์เมื่อไม่จำเป็นต้องใช้แล้ว
	defer func() {
		f.Close()
		os.Remove(f.Name())
	}()

	fmt.Println("สร้างไฟล์ชั่วคราว:", f.Name())

	// เขียนข้อมูลบางอย่างลงในไฟล์ชั่วคราว
	_, err = f.Write([]byte{1, 2, 3, 4})
	check(err, "ไม่สามารถเขียนลงในไฟล์ชั่วคราวได้")
	fmt.Println("เขียนไฟล์ชั่วคราวเรียบร้อย:", f.Name())

	// สร้างไดเรกทอรีชั่วคราวโดยใช้ os.MkdirTemp
	dname, err := os.MkdirTemp("", "sampledir")
	check(err, "ไม่สามารถสร้างไดเรกทอรีชั่วคราวได้")
	// ลบไดเรกทอรีเมื่อไม่จำเป็นต้องใช้แล้ว
	defer os.RemoveAll(dname)

	// สร้างไฟล์ในไดเรกทอรีชั่วคราว
	fname := filepath.Join(dname, "file1")
	err = os.WriteFile(fname, []byte{1, 2, 3, 4}, 0666)
	check(err, "ไม่สามารถเขียนลงในไฟล์ชั่วคราวได้")
	fmt.Println("เขียนไฟล์ชั่วคราวเรียบร้อย:", fname)
}

/* อธิบายโค้ด:
เราใช้ os.CreateTemp เพื่อสร้างไฟล์ชั่วคราวและคืนค่าเป็นตัวแปร tmpFile
ใช้ os.MkdirTemp เพื่อสร้างไดเร็กทอรีชั่วคราว
และใช้ filepath.Join เพื่อรวมชื่อไดเร็กทอรีกับชื่อไฟล์ในการสร้างไฟล์ชั่วคราวภายในไดเร็กทอรีนั้น
หลังจากใช้งานไฟล์หรือไดเร็กทอรีชั่วคราวเสร็จแล้ว เราใช้ os.Remove และ os.RemoveAll
เพื่อลบไฟล์และไดเร็กทอรีชั่วคราว
*/
