package main

import (
	"fmt"
	"os"
	"strings"
)

/* ตัวแปรสภาพแวดล้อม (Environment Variables) */
/* คือชุดของข้อมูลที่ประกอบด้วยเลขคู่ของคีย์และค่า (key-value) */
/* ซึ่งใช้ในการกำหนดค่าให้กับโปแกรมในระบบปฏิบัติการ UNIX โดยใน Go */
/* สามารถใช้ฟังก์ชัน os.Setenv(key, value) เพื่อกำหนดค่า และใช้ os.Getenv(key) */
/* เพื่อดึงค่าของตัวแปรสภาพแวดล้อมนั้น หากไม่มีการกำหนดคีย์ดังกล่าว */
/* จะคืนค่าว่างกลับมา */
/* เรายังสามารถใช้ os.Environ() เพื่อดึงรายการของตัวแปรสภาพแวดล้อมทั้งหมดในรูป */
/* แบบของ slice ที่เก็บข้อมูลเป็นสตริงในรูปแบบ "key=value" ซึ่งสามารถแยกข้อมูล */
/* เพื่อเข้าถึงแต่ละค่าได้ */
func main() {
	os.Setenv("FOO", "1")
	fmt.Println("FOO:", os.Getenv("FOO"))
	fmt.Println("BAR:", os.Getenv("BAR"))

	fmt.Println()
	// ลูปผ่านแต่ละตัวแปรสภพแวดล้อมใน slice นั้น
	for _, e := range os.Environ() {
		// แยกข้อความที่เป็นคู่ของคีย์ (KEY) และค่า (VALUE) โดยใช้สัญลักษณ์ "=" เป็นตัวแบ่ง
		//  และจำกัดจำนวน การแบ่งเป็น 2 ส่วน
		pair := strings.SplitN(e, "=", 2)
		fmt.Println(pair[0]) // แสดงเฉพาะคีย์ (KEY) ของแต่ละคู่
	}
}

// 1.ตั้งค่า Environment Variable: ใช้ os.Setenv("FOO", "1") เพื่อกำหนด่า
/* "FOO" เป็น "1" ในสภาพแวดล้อม */
/* 2.ดึงค่า Environment Variable: ใช้ os.Getenv("FOO") และ */
/* os.Getenv("BAR") เพื่อแสดงค่าของ "FOO" และ "BAR" */
/* โดย "BAR" ไม่ถูกตั้งค่า ดังนั้นจะคืนค่าว่าง */
/* 3.แสดงตัวแปรสภาพแวดล้อมทั้งหมด: ใช้ os.Environ() */
/* ดึงตัวแปรสภาพแวดล้อมทั้งหมด แล้วใช้ strings.SplitN() */
/* เพื่อแยกคีย์และค่า จากนั้นแสดงผลเฉพาะคีย์ของแต่ละตัวแปร */
/* ตัวแปร "FOO" จะแสดงผลแต่ "BAR" จะว่าง */
